In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.22.4 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.2.1'

In [6]:
lst = [1,2,3,4,5]
lst
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
arr = np.array(lst)
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
pd.Series(data = ["Raghvendra","Pranjal","Hero"], index = [1,2,3])

1    Raghvendra
2       Pranjal
3          Hero
dtype: object

In [13]:
steps = {'day 1' : 3000, 'day 2': 2000}
pd.Series(steps)
pd.Series(steps).repeat(5)

day 1    3000
day 1    3000
day 1    3000
day 1    3000
day 1    3000
day 2    2000
day 2    2000
day 2    2000
day 2    2000
day 2    2000
dtype: int64

In [17]:
pd.Series(steps).repeat(3).reset_index(drop=True)

0    3000
1    3000
2    3000
3    2000
4    2000
5    2000
dtype: int64

In [22]:
s = pd.Series([10,20,30]).repeat([5,3,2]).reset_index(drop=True)

In [23]:
s[0]

10

In [30]:
s[1:-1]

1    10
2    10
3    10
4    10
5    20
6    20
7    20
8    30
dtype: int64

In [37]:
sr = pd.Series([1,2,3,45,6,3])
sr.agg(['min','max'])

min     1
max    45
dtype: int64

In [35]:
sr = pd.Series([1,2,3,45,6,3])
sr.abs()

0     1
1     2
2     3
3    45
4     6
5     3
dtype: int64

In [42]:
sr = pd.Series([1,2,3,45,6,3])
sr1 = pd.Series([-1,-2,-3,-45,-6,-3])

In [48]:
pd.concat([sr1,sr]).reset_index(drop=True)

0     -1
1     -2
2     -3
3    -45
4     -6
5     -3
6      1
7      2
8      3
9     45
10     6
11     3
dtype: int64

In [49]:
sr = pd.Series([1,2,3,45,6,3])
print(sr)
print(sr.astype('float'))

0     1
1     2
2     3
3    45
4     6
5     3
dtype: int64
0     1.0
1     2.0
2     3.0
3    45.0
4     6.0
5     3.0
dtype: float64

In [5]:
sr = pd.Series([1,2,3,6,5,3,5,3])
sr.between(1,30)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

In [12]:
string1 = pd.Series([' Raghvendra','  Ritik','Rohit  ','Hello World'])
print(string1.str.upper())
print(string1.str.lower())
print(string1.str.len())
print(string1.str.strip())

0     RAGHVENDRA
1          RITIK
2        ROHIT
3    HELLO WORLD
dtype: object
0     raghvendra
1          ritik
2        rohit
3    hello world
dtype: object
0    11
1     7
2     7
3    11
dtype: int64
0     Raghvendra
1          Ritik
2          Rohit
3    Hello World
dtype: object

In [24]:
string1 = pd.Series([' Raghvendra','  Ritik','Rohit  ','Hello World'])
string1.str.split()

0      [Raghvendra]
1           [Ritik]
2           [Rohit]
3    [Hello, World]
dtype: object

In [23]:
string1.str.split()[3]

['Hello', 'World']

In [25]:
string1 = pd.Series([' Raghvendra','  Ritik','Rohit  ','Hello World'])
string1.str.contains('e')

0     True
1    False
2    False
3     True
dtype: bool

In [26]:
string1.str.replace('e','f')

0     Raghvfndra
1          Ritik
2        Rohit
3    Hfllo World
dtype: object

In [27]:
string1.str.count('a')

0    2
1    0
2    0
3    0
dtype: int64

In [28]:
string1.str.endswith('f')

0    False
1    False
2    False
3    False
dtype: bool

In [29]:
string1.str.endswith('a')

0     True
1    False
2    False
3    False
dtype: bool

In [30]:
string1.to_list()

[' Raghvendra', '  Ritik', 'Rohit  ', 'Hello World']

In [32]:
lst = ['Geeks','for','Geeks','is','a','portal','for','Geeks']
pd.DataFrame(lst)
type(pd.DataFrame(lst))

pandas.core.frame.DataFrame

In [33]:
lst = [['tom',10],['ritik',20],['raghvendra',80]]
pd.DataFrame(lst)

            0   1
0         tom  10
1       ritik  20
2  raghvendra  80

In [35]:
lst = {'Name':['Tom','Mike'], 'Score':[10,20]}
pd.DataFrame(lst)

   Name  Score
0   Tom     10
1  Mike     20

In [38]:
data = {'Name':['Raghvendra','Karan','Josh'],
        'Class':['MSC','MCA','BTech'],
        'Age':[20,35,34],
        'Address':['Kanpur','Jalandhar','Ranchi']}
df = pd.DataFrame(data)
df[['Name','Class']]
print(df)

         Name  Class  Age    Address
0  Raghvendra    MSC   20     Kanpur
1       Karan    MCA   35  Jalandhar
2        Josh  BTech   34     Ranchi

In [40]:
data = {'Name':['Raghvendra','Karan','Josh'],
        'Class':['MSC','MCA','BTech'],
        'Age':[20,35,34],
        'Address':['Kanpur','Jalandhar','Ranchi']}
df = pd.DataFrame(data)

In [48]:
df.loc[1:2,'Class': 'Age']

   Class  Age
1    MCA   35
2  BTech   34

In [51]:
df.iloc[1:2, 2:3 ]

   Age
1   35

In [52]:
df

         Name  Class  Age    Address
0  Raghvendra    MSC   20     Kanpur
1       Karan    MCA   35  Jalandhar
2        Josh  BTech   34     Ranchi

In [54]:
df[df['Age']>20]

    Name  Class  Age    Address
1  Karan    MCA   35  Jalandhar
2   Josh  BTech   34     Ranchi

In [55]:
l = [78,65,89]
df['Marks'] = l
df

         Name  Class  Age    Address  Marks
0  Raghvendra    MSC   20     Kanpur     78
1       Karan    MCA   35  Jalandhar     65
2        Josh  BTech   34     Ranchi     89

In [65]:
df['seven'] = df['Marks']+10

In [67]:
df

         Name  Class  Age    Address  Marks  seven
0  Raghvendra    MSC   20     Kanpur     78     88
1       Karan    MCA   35  Jalandhar     65     75
2        Josh  BTech   34     Ranchi     89     99

In [68]:
df.pop('seven')

0    88
1    75
2    99
Name: seven, dtype: int64

In [61]:
df

         Name  Class  Age    Address  Marks
0  Raghvendra    MSC   20     Kanpur     78
1       Karan    MCA   35  Jalandhar     65
2        Josh  BTech   34     Ranchi     89

In [69]:
df.T

                  0          1       2
Name     Raghvendra      Karan    Josh
Class           MSC        MCA   BTech
Age              20         35      34
Address      Kanpur  Jalandhar  Ranchi
Marks            78         65      89

In [70]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['Name', 'Class', 'Age', 'Address', 'Marks'], dtype='object')]

In [72]:
df.ndim

2

In [73]:
df.dtypes

Name       object
Class      object
Age         int64
Address    object
Marks       int64
dtype: object

In [74]:
df.shape

(3, 5)

In [78]:
df.head(1)

         Name Class  Age Address  Marks
0  Raghvendra   MSC   20  Kanpur     78

In [79]:
df.tail(1)

   Name  Class  Age Address  Marks
2  Josh  BTech   34  Ranchi     89

In [80]:
df.tail(0)

Empty DataFrame
Columns: [Name, Class, Age, Address, Marks]
Index: []

In [81]:
df.tail(2)

    Name  Class  Age    Address  Marks
1  Karan    MCA   35  Jalandhar     65
2   Josh  BTech   34     Ranchi     89

In [83]:
df.empty

False

In [85]:
num = {'one':[1,2,3,4],
       'two':[2,4,6,8],
       'three':[3,6,9,12],
       'four':[4,8,12,16]}
df1 = pd.DataFrame(num)
df1

   one  two  three  four
0    1    2      3     4
1    2    4      6     8
2    3    6      9    12
3    4    8     12    16

In [87]:
df1.sum()

one      10
two      20
three    30
four     40
dtype: int64

In [88]:
df1.mean()

one       2.5
two       5.0
three     7.5
four     10.0
dtype: float64

In [89]:
df1.median()

one       2.5
two       5.0
three     7.5
four     10.0
dtype: float64

In [93]:
df1['one'].mode()

0    1
1    2
2    3
3    4
Name: one, dtype: int64

In [94]:
df1.min()

one      1
two      2
three    3
four     4
dtype: int64

In [95]:
df1.std()

one      1.290994
two      2.581989
three    3.872983
four     5.163978
dtype: float64

In [96]:
df1.var()

one       1.666667
two       6.666667
three    15.000000
four     26.666667
dtype: float64

In [97]:
df1.describe()

            one       two      three       four
count  4.000000  4.000000   4.000000   4.000000
mean   2.500000  5.000000   7.500000  10.000000
std    1.290994  2.581989   3.872983   5.163978
min    1.000000  2.000000   3.000000   4.000000
25%    1.750000  3.500000   5.250000   7.000000
50%    2.500000  5.000000   7.500000  10.000000
75%    3.250000  6.500000   9.750000  13.000000
max    4.000000  8.000000  12.000000  16.000000

In [100]:
def add_(i,j):
    return i+j

df1.pipe(add_, 10)

   one  two  three  four
0   11   12     13    14
1   12   14     16    18
2   13   16     19    22
3   14   18     22    26

In [101]:
df1.apply(lambda x : x.max()-x.min() )

one       3
two       6
three     9
four     12
dtype: int64

In [102]:
df1.applymap(lambda x : x+100)

/tmp/ipykernel_1300/1158568555.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df1.applymap(lambda x : x+100)

   one  two  three  four
0  101  102    103   104
1  102  104    106   108
2  103  106    109   112
3  104  108    112   116

In [104]:
df = pd.read_csv('Football.csv')
df

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
658,Netherlands,Eredivisie,NaN,Cyriel Dessers,26,0,2461,15,14.51,0.56,84,43,3.24,1.66,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     626 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [107]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [109]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [110]:
df.describe()

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
25%,14.000000,0.000000,1363.500000,8.000000,6.100000,0.340000,37.750000,17.000000,2.335000,0.980000,2017.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
75%,31.000000,5.000000,2822.000000,14.000000,13.252500,0.570000,86.000000,37.000000,3.382500,1.540000,2019.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [112]:
df.describe(percentiles=[0.8])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [114]:
df['Mins'].quantile(0.99)

3520.0199999999995

In [115]:
de = df.copy()
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [118]:
de.dropna()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

In [121]:
de.dropna(inplace=True)

In [122]:
de.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

In [123]:
import pandas_profiling as np

ModuleNotFoundError: No module named 'pandas_profiling'

In [124]:
import pandas_profiling as pp

ModuleNotFoundError: No module named 'pandas_profiling'